package day061;

public class Istens {

	public static void main(String[] args) {
		//인스턴스 변수
		//객체마다 갖는 고유한 변수
		/*인스턴스 생성할 때 만들어지며, 각각의 인스턴스 마다 자신의 값을 갖고 있음
		 *각 인스턴스 마다 다른 값을 가져야 할 때 생성
		 *인스턴스 생성시 메모리 생성
		 *
		 *예시 사례
		 * a스포츠 센터 회원에 대한 정보를 관리
		 * 
		 * class 회원
		 *  내부 - 이름 나이 성별
		 *  
		 *  인스턴스 변수
		 *  class 클래스명 { 자료형,변수명; }
		 */
		
		/* 클래스변수
		 * 모든 개게가 동일안 값을 가질때 갖는 변수
		 * 모든 인스턴스가 같은 저장공간을 공유
		 * 인스턴스 없이 사용가능
		 * 
		 * class 클래스명{static 자료형, 변수명 ;}
		 */
	}

}
