package day065;

public class D_class {

	public static void main(String[] args) {
		// 다형성이란 
		// 한가지의 타입이 여러가지 형태의 인스턴스를 가질 수 있는것
		//casting
		//        upcasting   자식 클랙스가 부모클랙스의 참조 변수로 형 변환 되는 것
		//                    부모클랙스 변수 == 자식객체값;
		//        dowmcasting 업 캐스팅 된 부모 클래스의 객체가 자식 클래스의 참조 변수로 형 변환 되는 것
		//                    자식클래스 변수 =(자식 클랙스) 업캐스팅 된 부모 참조변수;
		//                    ** 업캐스팅 된 부모 변수만 다운캐스팅으로 되돌려 놓을 수 있음
		//                    ** 어떻게 변환 될 건지 명시적 형 변환을 해야함
	}
}
