package day059;

public class Note_class {

	public static void main(String[] args) {
		/* 객체지향 언어란?
		 * 정의;
		 * 객체지향 언어란, 현실에 존재하는 사물과 개념들을 소프트웨어적으로 구현하고, 구 구현된 객체들이 상호작용하여 데이터를 처리하는 방식
		 * 목적;
		 * 코드의 재 사용;
		 * 객체란? 독립적으로 존재할 수 있는것 / 객체를 지향한다? 코드를 객체화 하여 독립적으 존재할 수 있도록 함.;
		 */		
		/* 절차 지향언어;
		 * 명령을 순서대로 처리하는 방식.;
		 */
		/* 객체 지향 언어의 특징
		 * 추상화 : 공통적인 특징을 모아놓은 것. ex) 택시, 버스, bmw 공통적 특징은? 핸들이 있다. 바퀴가 있다 등등;
		 * 의미 위 공통점을 만들어 둔 채로 택시를 만들 때 위 공통점을 모아둔 그룹을 적용시키는 것;
		 * 베이스가 될 요소들을 모아 사용을 함으로 같은 코드를 사용하는 것의 번거로움을 없애는 것;
		 * 사용자는 구성을 알 필요가 없이 기능만 알면 됨
		 * 상속
		 * 캡슐화
		 * 다형성 : 같은 모양을 갖고 있으나 다른의미르 갖고 있는 것 ex) 같은 배라도 다른 종류의 배들.
		 * 다양한 동물의 소리를 취합해서 동물의 소리내기 라는 기능을 객체로 만들어냄
		 * 사용기능
		 * 메서드 오버로딩(overloading)
		 * 
		 * 메서드 오버라이딩(over Riding) 함수의 재정의
		 *    부모와 자식 관계에서 성립하는 구조.
		 *    동물의 소리내기가 으앙 (부)-> 강아지 소리내기 멍멍 (자) // 동물에서 소리내기를 가지고 왔지만 강아지는 자신의 소리에 맞춰서 변형되는것
		 */
}

}
